Revit 2027 API
ParameterTypeId.StructuralBeamStartSupport Property
 "Beam Start Pocket Seat"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralBeamStartSupport { get; }
Public Shared ReadOnly Property StructuralBeamStartSupport As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralBeamStartSupport {
	ForgeTypeId^ get ();
}
static member StructuralBeamStartSupport : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace